notebook/philosophy.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>My Study Plan for Modern Philosophy</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 19:51:38 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">My Study Plan for Modern Philosophy</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Books </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="done DONE"> DONE</span> Russell, "History of Western Philosophy" </h3>
<div class="outline-text-3" id="text-1-1">

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="done DONE"> DONE</span> Russell, "Why I am Not a Christian" </h3>
<div class="outline-text-3" id="text-1-2">

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="done DONE"> DONE</span> Lewis, "Mind and the World Order" </h3>
<div class="outline-text-3" id="text-1-3">

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="done DONE"> DONE</span> Dewey, "How We Think" </h3>
<div class="outline-text-3" id="text-1-4">

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="done DONE"> DONE</span> Descartes, "A Discourse on the Method" </h3>
<div class="outline-text-3" id="text-1-5">

</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="done DONE"> DONE</span> Wittgenstein, "The Blue Book" </h3>
<div class="outline-text-3" id="text-1-6">

</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="done DONE"> DONE</span> Ayer, "Language, Truth, and Logic" </h3>
<div class="outline-text-3" id="text-1-7">

</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="done DONE"> DONE</span> Ellis, "Against Deconstruction" </h3>
<div class="outline-text-3" id="text-1-8">

</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="done DONE"> DONE</span> Ellis, "Language, Thought, and Logic" </h3>
<div class="outline-text-3" id="text-1-9">

</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="todo TODO"> TODO</span> Aristotle, "The Metaphysics" </h3>
<div class="outline-text-3" id="text-1-10">

</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="todo TODO"> TODO</span> Descartes, "Meditations on the First Philosophy" </h3>
<div class="outline-text-3" id="text-1-11">

</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="todo TODO"> TODO</span> Descartes, "Principles of Philosophy" </h3>
<div class="outline-text-3" id="text-1-12">

</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="todo TODO"> TODO</span> Locke, "The Conduct of the Understanding" </h3>
<div class="outline-text-3" id="text-1-13">

</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="todo TODO"> TODO</span> Locke, "An Essay Concerning Human Understanding" </h3>
<div class="outline-text-3" id="text-1-14">

</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="todo TODO"> TODO</span> Spinoza, "On the Improvement of the Understanding" </h3>
<div class="outline-text-3" id="text-1-15">

</div>

</div>

<div id="outline-container-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="todo TODO"> TODO</span> Leibniz, "Monadology" </h3>
<div class="outline-text-3" id="text-1-16">

</div>

</div>

<div id="outline-container-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="todo TODO"> TODO</span> Berkeley, "A Treatise Concerning the Principles of Human Knowledge" </h3>
<div class="outline-text-3" id="text-1-17">

</div>

</div>

<div id="outline-container-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="todo TODO"> TODO</span> Hume, "An Enquiry Concerning Human Understanding" </h3>
<div class="outline-text-3" id="text-1-18">

</div>

</div>

<div id="outline-container-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="todo TODO"> TODO</span> Hume, "Dialogues Concerning Natural Religion" </h3>
<div class="outline-text-3" id="text-1-19">

</div>

</div>

<div id="outline-container-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="todo TODO"> TODO</span> Goethe, "Theory of Colours" </h3>
<div class="outline-text-3" id="text-1-20">

</div>

</div>

<div id="outline-container-1-21" class="outline-3">
<h3 id="sec-1-21"><span class="todo TODO"> TODO</span> Kant, "Logic" </h3>
<div class="outline-text-3" id="text-1-21">

</div>

</div>

<div id="outline-container-1-22" class="outline-3">
<h3 id="sec-1-22"><span class="todo TODO"> TODO</span> Kant, "Critique of Pure Reason" </h3>
<div class="outline-text-3" id="text-1-22">

</div>

</div>

<div id="outline-container-1-23" class="outline-3">
<h3 id="sec-1-23"><span class="todo TODO"> TODO</span> Hegel, "Phenomenology of Mind" </h3>
<div class="outline-text-3" id="text-1-23">

</div>

</div>

<div id="outline-container-1-24" class="outline-3">
<h3 id="sec-1-24"><span class="todo TODO"> TODO</span> Hegel, "Science of Logic" </h3>
<div class="outline-text-3" id="text-1-24">

</div>

</div>

<div id="outline-container-1-25" class="outline-3">
<h3 id="sec-1-25"><span class="todo TODO"> TODO</span> Boole, "The Laws of Thought" </h3>
<div class="outline-text-3" id="text-1-25">

</div>

</div>

<div id="outline-container-1-26" class="outline-3">
<h3 id="sec-1-26"><span class="todo TODO"> TODO</span> Schopenhauer, "The World as Will and Representation" </h3>
<div class="outline-text-3" id="text-1-26">

</div>

</div>

<div id="outline-container-1-27" class="outline-3">
<h3 id="sec-1-27"><span class="todo TODO"> TODO</span> Russell, "Analysis of Mind" </h3>
<div class="outline-text-3" id="text-1-27">

</div>

</div>

<div id="outline-container-1-28" class="outline-3">
<h3 id="sec-1-28"><span class="todo TODO"> TODO</span> Russell, "Introduction to Mathematical Philosophy" </h3>
<div class="outline-text-3" id="text-1-28">

</div>

</div>

<div id="outline-container-1-29" class="outline-3">
<h3 id="sec-1-29"><span class="todo TODO"> TODO</span> Whitehead, "Introduction to Mathematics" </h3>
<div class="outline-text-3" id="text-1-29">

</div>

</div>

<div id="outline-container-1-30" class="outline-3">
<h3 id="sec-1-30"><span class="todo TODO"> TODO</span> Whitehead, "A Treatise on Universal Algebra" </h3>
<div class="outline-text-3" id="text-1-30">

</div>

</div>

<div id="outline-container-1-31" class="outline-3">
<h3 id="sec-1-31"><span class="done DONE"> DONE</span> Whitehead, "Symbolism" </h3>
<div class="outline-text-3" id="text-1-31">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2008-03-07 Fri 05:03</span></span><br/>
</p></div>

</div>

<div id="outline-container-1-32" class="outline-3">
<h3 id="sec-1-32"><span class="todo TODO"> TODO</span> Whitehead, "Process and Reality" </h3>
<div class="outline-text-3" id="text-1-32">

</div>

</div>

<div id="outline-container-1-33" class="outline-3">
<h3 id="sec-1-33"><span class="todo TODO"> TODO</span> Wittgenstein, "Tractatus Logico-Philosophicus" </h3>
<div class="outline-text-3" id="text-1-33">

</div>

</div>

<div id="outline-container-1-34" class="outline-3">
<h3 id="sec-1-34"><span class="todo TODO"> TODO</span> Wittgenstein, "The Brown Book" </h3>
<div class="outline-text-3" id="text-1-34">

</div>

</div>

<div id="outline-container-1-35" class="outline-3">
<h3 id="sec-1-35"><span class="todo TODO"> TODO</span> Wittgenstein, "Philosophical Investigations" </h3>
<div class="outline-text-3" id="text-1-35">

</div>

</div>

<div id="outline-container-1-36" class="outline-3">
<h3 id="sec-1-36"><span class="todo TODO"> TODO</span> Carnap, "The Logical Syntax of Language" </h3>
<div class="outline-text-3" id="text-1-36">

</div>

</div>

<div id="outline-container-1-37" class="outline-3">
<h3 id="sec-1-37"><span class="todo TODO"> TODO</span> Carnap, "Introduction to Symbolic Logic with Applications" </h3>
<div class="outline-text-3" id="text-1-37">

</div>

</div>

<div id="outline-container-1-38" class="outline-3">
<h3 id="sec-1-38"><span class="todo TODO"> TODO</span> Quine, "Word and Object" </h3>
<div class="outline-text-3" id="text-1-38">

</div>

</div>

<div id="outline-container-1-39" class="outline-3">
<h3 id="sec-1-39"><span class="todo TODO"> TODO</span> Quine, "Philosophy of Logic" </h3>
<div class="outline-text-3" id="text-1-39">

</div>

</div>

<div id="outline-container-1-40" class="outline-3">
<h3 id="sec-1-40"><span class="todo TODO"> TODO</span> Heidegger, "Being and Time" </h3>
<div class="outline-text-3" id="text-1-40">

</div>

</div>

<div id="outline-container-1-41" class="outline-3">
<h3 id="sec-1-41"><span class="todo TODO"> TODO</span> Santayana, "The Sense of Beauty" </h3>
<div class="outline-text-3" id="text-1-41">



</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">People to add </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Pierce </h3>
<div class="outline-text-3" id="text-2-1">

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">James </h3>
<div class="outline-text-3" id="text-2-2">

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Goedel </h3>
<div class="outline-text-3" id="text-2-3">

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">De Morgan </h3>
<div class="outline-text-3" id="text-2-4">

</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5">Kierkegaard </h3>
<div class="outline-text-3" id="text-2-5">

</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6">Tarski </h3>
<div class="outline-text-3" id="text-2-6">

</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7">Frege </h3>
<div class="outline-text-3" id="text-2-7">


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Things to consider </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><a href="http://www.londonexternal.ac.uk/prospective_students/undergraduate/birkbeck/philosophy/index.shtml">http://www.londonexternal.ac.uk/prospective_students/undergraduate/birkbeck/philosophy/index.shtml</a> </h3>
<div class="outline-text-3" id="text-3-1">

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Master's is more doable than PhD </h3>
<div class="outline-text-3" id="text-3-2">

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><a href="http://schwitzsplinters.blogspot.com/2007/10/applying-to-philosophy-phd-programs_16.html">http://schwitzsplinters.blogspot.com/2007/10/applying-to-philosophy-phd-programs_16.html</a> </h3>
<div class="outline-text-3" id="text-3-3">

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><a href="http://www.bu.edu/summer/college_courses/philosophy/?source=google">http://www.bu.edu/summer/college_courses/philosophy/?source=google</a> </h3>
<div class="outline-text-3" id="text-3-4">


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-08-02 19:51:38 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
